
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		// Заполнение шапки
		Сотрудник = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТрудоваяДеятельность Из ДанныеЗаполнения.ТрудоваяДеятельность Цикл
			НоваяСтрока = ТрудоваяДеятельность.Добавить();
			НоваяСтрока.Должность = ТекСтрокаТрудоваяДеятельность.Должность;
			НоваяСтрока.НачалоРаботы = ТекСтрокаТрудоваяДеятельность.НачалоРаботы;
			НоваяСтрока.ОкончаниеРаботы = ТекСтрокаТрудоваяДеятельность.ОкончаниеРаботы;
			НоваяСтрока.Организация = ТекСтрокаТрудоваяДеятельность.Организация;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
