&НаКлиенте
Процедура ДобавитьЗначениеВПоле(Текст, ПолеВвода)
	
	Если Текст <> "" Тогда       
		Объект.Наименование = Объект.Наименование + " " + Текст;
		ПолеВвода = Текст;
  	КонецЕсли
	
КонецПроцедуры


&НаКлиенте
Процедура ФамилияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ДобавитьЗначениеВПоле(Текст, Объект.Фамилия);
КонецПроцедуры

&НаКлиенте
Процедура ИмяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ДобавитьЗначениеВПоле(Текст, Объект.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ДобавитьЗначениеВПоле(Текст, Объект.Отчество);
КонецПроцедуры
