
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;  
	Печать(ТабДок, ПараметрКоманды); 
	
	ТабДок.Защита 		  = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.Показать("ПрайсЛист");
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, СсылкаНаНоменклатуру)

	Макет = Справочники.Номенклатура.ПолучитьМакет("ПрайсЛист");
	
	ОблШапка 	    = Макет.ПолучитьОбласть("Шапка");
	ОблНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
	

	// Заполняем шапку                                        
	ОблШапка.Параметры.РабочаяДата = ТекущаяДата();
	
	
	// Заполняем номенклатуру    
	
	// заполнение области я сделал по конкретной номенклатуре
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.ЦенаПродажи КАК Цена,
		|	Номенклатура.ОснЕдиницаИзмерения КАК ОснЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &СсылкаНаНоменклатуру";
	
	Запрос.УстановитьПараметр("СсылкаНаНоменклатуру", СсылкаНаНоменклатуру);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();              
	
	Пока Выборка.Следующий() Цикл
		
	  	ОблНоменклатура.Параметры.Код 	       	 = Выборка.Код;
		ОблНоменклатура.Параметры.Наименование   = Выборка.Наименование; 
		ОблНоменклатура.Параметры.ОснЕдИзмерения = Выборка.ОснЕдиницаИзмерения;
		ОблНоменклатура.Параметры.Цена 		   	 = Выборка.Цена;
				
	КонецЦикла; 
	
	ТабДок.Вывести(ОблШапка);
	ТабДок.Вывести(ОблНоменклатура);
	
	                                                	
КонецПроцедуры
