
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Доступ = Новый Массив;
	ПоляДоступа = Новый Массив;
	ПоляРегистрации = Новый Массив;
	
	ПоляРегистрации.Добавить("Ссылка");
	       
	// Справочник
	Описание = Новый ОписаниеИспользованияСобытияДоступЖурналаРегистрации;    
	Описание.Объект = "Справочник.Номенклатура";
	Описание.ПоляДоступа = ПоляДоступа;
	Описание.ПоляРегистрации = ПоляРегистрации;
	
	Доступ.Добавить(Описание);
	
	ПоляДоступа = Новый Массив;
	ПоляДоступа.Добавить("Цена"); 
	
	ПоляРегистрации = Новый Массив;
	ПоляРегистрации.Добавить("Номенклатура");
	ПоляРегистрации.Добавить("Цена");     
	
	// Регистр сведений
	Описание = Новый ОписаниеИспользованияСобытияДоступЖурналаРегистрации;    
	Описание.Объект = "РегистрСведений.ЦеныНоменклатуры";
	Описание.ПоляДоступа = ПоляДоступа;
	Описание.ПоляРегистрации = ПоляРегистрации;
	
	Доступ.Добавить(Описание);
	
	Исп = Новый ИспользованиеСобытияЖурналаРегистрации(Истина);
	Исп.ОписаниеИспользования = Доступ;
	
	УстановитьИспользованиеСобытияЖурналаРегистрации("_$Access$_.Access", Исп); 
	
	
	ЗаписатьТекущегоПользователяВСправочник();  
	
КонецПроцедуры


&НаСервере
Процедура ЗаписатьТекущегоПользователяВСправочник()

	ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();  
		
	Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ТекПользователь);	
	
	// Если Пользователя нет в справочнике тогда создаю его в справочнике:
	Если Пользователь.Наименование = "" Тогда   
		
		СправочникПользователи = Справочники.Пользователи;
		
	    НовыйПользователь = СправочникПользователи.СоздатьЭлемент();
		НовыйПользователь.Наименование = ТекПользователь;
		
		НовыйПользователь.Записать();
			
	КонецЕсли;
	
	ПараметрыСеанса.ПользовательСеанса = Пользователь;
	
КонецПроцедуры


