
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровИУслуг.Ссылка КАК Ссылка,
		|	NULL КАК Номенклатура
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
		
	Для Каждого Результат Из РезультатЗапроса Цикл
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			Сообщить(Выборка.Ссылка);		
		
		КонецЦикла;		
		
	КонецЦикла;
	
	
			
КонецПроцедуры
