
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Заполнение шапки
		Контрагент 	    = ДанныеЗаполнения.Ссылка;
		ПодотчётноеЛицо = ПолучитьПоследнийДокумент(Контрагент);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнийДокумент(НашКонтрагент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоступлениеТоваровИУслуг.ПодотчётноеЛицо КАК КонтактноеЛицо
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
		|ГДЕ
		|	ПоступлениеТоваровИУслуг.Контрагент = &Контрагент
		|	И ПоступлениеТоваровИУслуг.Проведен = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоступлениеТоваровИУслуг.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", НашКонтрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КонтактноеЛицо;
	КонецЦикла;	
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Закупки Приход
	Движения.Закупки.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Закупки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.КонтактноеЛицо = ПодотчётноеЛицо;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.СтепеньБрака = ТекСтрокаТовары.СтепеньБрака;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;

КонецПроцедуры
